app/controllers/dashboards_controller.rb

SELECT "expenses".* FROM "expenses" WHERE (expense_date >= '2020-05-01 00:00:00' AND expense_date <= '2020-05-31 23:59:59') ORDER BY expense_date ASC
SELECT SUM("expenses"."value") FROM "expenses" WHERE (expense_date >= '2020-05-01 00:00:00' AND expense_date <= '2020-05-31 23:59:59') AND "expenses"."type_id" = ?  [["type_id", 1]]
---
  def index

    @tab = :dashboard
    @today = Expense.where( expense_date: Date.today )
    @yesterday = Expense.where( expense_date: Date.today - 1)
    @this_month = Expense.by_month( Date.today )
    @last_month = Expense.by_month( Date.today - 1.month )

    @last_6_months = [
    	{ name: "Transporte", data: Expense.where( category_id: 1 ).last_6_months.sum( :value )},
    	{ name: "Servicios públicos",	data: Expense.where( category_id: 2 ).last_6_months.sum( :value )},
    	{ name: "Hipoteca",	data: Expense.where( category_id: 3 ).last_6_months.sum( :value )},
    	{ name: "Teléfono",	data: Expense.where( category_id: 4 ).last_6_months.sum( :value )},
      { name: "Familia", data: Expense.where( category_id: 5 ).last_6_months.sum( :value )},
      { name: "Mercado", data: Expense.where( category_id: 6 ).last_6_months.sum( :value )},
      { name: "Banda", data: Expense.where( category_id: 7 ).last_6_months.sum( :value )}
    ]

    @each_day = [
    	{ name: "Transporte", data: Expense.where( category_id: 1 ).select_day.sum( :value )},
    	{ name: "Servicios públicos",	data: Expense.where( category_id: 2 ).select_day.sum( :value )},
    	{ name: "Hipoteca",	data: Expense.where( category_id: 3 ).select_day.sum( :value )},
    	{ name: "Teléfono",	data: Expense.where( category_id: 4 ).select_day.sum( :value )},
      { name: "Familia", data: Expense.where( category_id: 5 ).select_day.sum( :value )},
      { name: "Mercado", data: Expense.where( category_id: 6 ).select_day.sum( :value )},
      { name: "Banda", data: Expense.where( category_id: 7 ).select_day.sum( :value )}
    ]

    @each_type = [
    	[ "Tarjeta de ahorros", @this_month.where( type_id: 1 ).sum( :value )],
    	[ "Tarjeta de crédito",	@this_month.where( type_id: 2 ).sum( :value )],
    	[ "Crediágil",	@this_month.where( type_id: 3 ).sum( :value )],
    	[ "Fiducia",	@this_month.where( type_id: 4 ).sum( :value )]
    ]