app/controllers/expenses_controller.rb

  def index
    @categories = Category.all
    @types = Type.all
    @expenses = Expense.order("expense_date DESC")

    type_id = params[ :type_id ] unless params[ :type_id ] == ''
    category_id = params[ :category_id ] unless params[ :category_id ] == ''

    if type_id.present?
      @expenses = Expense.select_type( type_id.to_i )
---
SELECT "categories".* FROM "categories"
SELECT "types".* FROM "types"
SELECT "expenses".* FROM "expenses" WHERE (expense_date >= '2020-05-01 00:00:00' AND expense_date <= '2020-05-31 23:59:59') ORDER BY expense_date DESC
SELECT "expenses".* FROM "expenses"

  def create
    @expense = Expense.create(expense_params)
---
INSERT INTO "expenses" ("value", "concept", "expense_date", "type_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)